Revit 2026 API

# SchedulableFieldParameterId Property

---

The ID of the parameter displayed by the field.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ParameterId { get; set; }
```
```vb
Public Property ParameterId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ ParameterId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member ParameterId : ElementId with get, set
```

#### Property Value

ElementId The parameter ID, or InvalidElementId.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

Most non-calculated field types require a parameter ID. The Count field doesn't have a parameter ID.

#### Reference

SchedulableField Class

Autodesk.Revit.DB Namespace